app/controllers/pay_periods_controller.rb

  def index
    @pay_periods = PayPeriod.all
---
SELECT "pay_periods".* FROM "pay_periods"